# Plant_GetToolSpacing

## Description
Gets the current spacing associated with the plant tool.

```pascal
FUNCTION Plant_GetToolSpacing : REAL;
```

```python
def vs.Plant_GetToolSpacing():
    return REAL
```

## Version
Availability: from Vectorworks 2014

## Category
* PlantObjectCoreTools